create role university_admin with superuser login password '1234';

create database university with 
	locale 'ru_RU.UTF-8'
	connection limit 100;

create table if not exists "group"(
	group_id serial,
	num text not null default 'Группа',
	primary key(group_id)
);

create table if not exists Students(
	stud_id serial,
	FIO text not null default 'Ф.И.О',
	group_id int,
	primary key (stud_id),
	foreign key (group_id) references "group"(group_id)
);

create table if not exists Subjects(
	subj_id serial,
	subj_name text not null default 'unknown',
	primary key(subj_id)
);

create table if not exists Teachers(
	teacher_id serial,
	FIO text not null default 'Ф.И.О',
	subj_id int,
	primary key(teacher_id),
	foreign key (subj_id) references Subjects(subj_id)
);

create table if not exists Marks(
	mark_id serial,
	stud_id int,
	subj_id int,
	mark int not null default '2',
	primary key(mark_id),
	foreign key (subj_id) references Subjects(subj_id),
	foreign key (stud_id) references Students(stud_id)
);


create index if not exists id_num on "group"(num);

create index if not exists id_sFIO on Students(FIO);

create index if not exists id_tFIO on Teachers(FIO);

create index if not exists id_subj on Subjects(subj_name);

create index if not exists id_mark on Marks(mark);


insert into "group"(num) values('ПМ-31'),('ПМ-32');

insert into subjects(subj_name) values
('ТСП'),
('МПСиС'),
('БД'),
('Мат.Логика'),
('БЖД'),
('Философия'),
('Общая алгебра'),
('Численные методы');

insert into Teachers(FIO,subj_id) values
('Сергачев Максим Андреевич','5'),('Шанков Иван Васильевич','6'),
('Васильченко Олег Николаевич','2'),('Зубенко Валерий Альбертович','3'),
('Романова Анастасия Владимировна','1'),('Носова Елена Владимировна','5'),
('Шумков Алексей Петрович','7'),('Краснов Александр Александрович','8'),
('Замской Сергей Сергеевич','3'),('Васильев Сергей Николаевич','6'),
('Савельева Ксения Максимовна','2'),('Морозова Наталья Андреевна','8'),
('Крылов Константин Григорьевич','1'),('Дергач Софья Николаевна','4'),
('Донской Роман Викторович','7'),('Смирнов Тимур Захарович','4');


insert into Students(FIO,group_id) values
('Груздов Михаил Денисович',1),('Ларев Андрей Алексеевич',2),
('Хурмулев Роман Владимирович',1),('Тихонов Алексей Алексеевич',2),
('Ивашков Степан Сергеевич',1),('Петросова Анастасия Григорьевна',2),
('Лавров Константин Андреевич',1),('Гирей Софья Михайловна',2),
('Стрельников Василий Васильевич',1),('Поляков Алексей Андреевич',2),
('Сивак Валерия Николаевна',1),('Коротких Дмитрий Дмитриевич',2),
('Кругликов Роман Викторович',1),('Ишков Владимир Максимович',2),
('Тищенко Маргарита Григорьевна',1),('Петров Илья Сергеевич',2);


insert into Marks(stud_id,subj_id,mark) values
(1, 1, 3),(1, 1, 4),(1, 2, 5),(1, 2, 5),(1, 3, 2),(1, 3, 3),(1, 4, 5),(1, 4, 4),
(1, 5, 4),(1, 5, 3),(1, 6, 4),(1, 6, 5),(1, 7, 4),(1, 7, 4),(1, 7, 5),(1, 7, 5),

(2, 1, 4),(2, 1, 2),(2, 2, 5),(2, 2, 2),(2, 3, 4),(2, 3, 4),(2, 4, 3),(2, 4, 4),
(2, 5, 4),(2, 5, 4),(2, 6, 3),(2, 6, 2),(2, 7, 2),(2, 7, 5),(2, 8, 5),(2, 8, 2),

(3, 1, 3),(3, 1, 2),(3, 2, 3),(3, 2, 2),(3, 3, 2),(3, 3, 4),(3, 4, 3),(3, 4, 3),
(3, 5, 5),(3, 5, 5),(3, 6, 3),(3, 6, 5),(3, 7, 4),(3, 7, 4),(3, 8, 3),(3, 8, 4),

(4, 1, 2),(4, 1, 5),(4, 2, 4),(4, 2, 5),(4, 3, 5),(4, 3, 5),(4, 4, 5),(4, 4, 5),
(4, 5, 5),(4, 5, 3),(4, 6, 3),(4, 6, 5),(4, 7, 5),(4, 7, 2),(4, 8, 2),(4, 8, 3),

(5, 1, 3),(5, 1, 2),(5, 2, 2),(5, 2, 3),(5, 3, 3),(5, 3, 3),(5, 4, 2),(5, 4, 4),
(5, 5, 2),(5, 5, 2),(5, 6, 5),(5, 6, 4),(5, 7, 2),(5, 7, 3),(5, 8, 2),(5, 8, 5),

(6, 1, 4),(6, 1, 2),(6, 2, 4),(6, 2, 3),(6, 3, 4),(6, 3, 5),(6, 4, 5),(6, 4, 3),
(6, 5, 3),(6, 5, 4),(6, 6, 2),(6, 6, 4),(6, 7, 4),(6, 7, 4),(6, 8, 4),(6, 8, 5),

(7, 1, 4),(7, 1, 5),(7, 2, 5),(7, 2, 5),(7, 3, 2),(7, 3, 5),(7, 4, 3),(7, 4, 4),
(7, 5, 4),(7, 5, 4),(7, 6, 4),(7, 6, 5),(7, 7, 5),(7, 7, 3),(7, 8, 2),(7, 8, 2),

(8, 1, 3),(8, 1, 4),(8, 2, 4),(8, 2, 2),(8, 3, 3),(8, 3, 3),(8, 4, 4),(8, 4, 5),
(8, 5, 3),(8, 5, 5),(8, 6, 3),(8, 6, 3),(8, 7, 5),(8, 7, 3),(8, 8, 5),(8, 8, 5),

(9, 1, 4),(9, 1, 4),(9, 2, 3),(9, 2, 3),(9, 3, 2),(9, 3, 3),(9, 4, 5),(9, 4, 3),
(9, 5, 3),(9, 5, 2),(9, 6, 2),(9, 6, 3),(9, 7, 4),(9, 7, 4),(9, 8, 2),(9, 8, 2),

(10, 1, 4),(10, 1, 4),(10, 2, 5),(10, 2, 5),(10, 3, 5),(10, 3, 4),(10, 4, 3),(10, 4, 3),
(10, 5, 5),(10, 5, 2),(10, 6, 4),(10, 6, 3),(10, 7, 2),(10, 7, 4),(10, 8, 5),(10, 8, 2),

(11, 1, 4),(11, 1, 3),(11, 2, 5),(11, 2, 2),(11, 3, 5),(11, 3, 5),(11, 4, 5),(11, 4, 4),
(11, 5, 5),(11, 5, 5),(11, 6, 2),(11, 6, 2),(11, 7, 2),(11, 7, 5),(11, 8, 4),(11, 8, 3),

(12, 1, 3),(12, 1, 4),(12, 2, 5),(12, 2, 3),(12, 3, 2),(12, 3, 4),(12, 4, 3),(12, 4, 3),
(12, 5, 3),(12, 5, 4),(12, 6, 2),(12, 6, 3),(12, 7, 4),(12, 7, 4),(12, 8, 2),(12, 8, 4),

(13, 1, 4),(13, 1, 2),(13, 2, 2),(13, 2, 3),(13, 3, 4),(13, 3, 4),(13, 4, 2),(13, 4, 4),
(13, 5, 3),(13, 5, 2),(13, 6, 4),(13, 6, 5),(13, 7, 4),(13, 7, 3),(13, 8, 2),(13, 8, 4),

(14, 1, 5),(14, 1, 4),(14, 2, 5),(14, 2, 2),(14, 3, 3),(14, 3, 4),(14, 4, 3),(14, 4, 4),
(14, 5, 4),(14, 5, 2),(14, 6, 3),(14, 6, 2),(14, 7, 3),(14, 7, 5),(14, 8, 2),(14, 8, 3),

(15, 1, 2),(15, 1, 3),(15, 2, 3),(15, 2, 4),(15, 3, 5),(15, 3, 4),(15, 4, 4),(15, 4, 2),
(15, 5, 5),(15, 5, 3),(15, 6, 2),(15, 6, 5),(15, 7, 3),(15, 7, 5),(15, 8, 4),(15, 8, 2),

(16, 1, 3),(16, 1, 3),(16, 2, 5),(16, 2, 4),(16, 3, 2),(16, 3, 3),(16, 4, 5),(16, 4, 3),
(16, 5, 2),(16, 5, 4),(16, 6, 5),(16, 6, 2),(16, 7, 5),(16, 7, 5),(16, 8, 3),(16, 8, 5);

	